CallBackSampleRequests/CallBackCheckAddressDataV2Request.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:jms1="http://www.tibco.com/namespaces/tnt/plugins/jms">
    <SOAP-ENV:Body>
        <CallBackCheckAddressDataV2Request xmlns="http://xmlns.vodafone.hu/BusinessMessage/VettingInterface/VettingService/V1.1">
            <ns0:Header xmlns:ns0="http://xmlns.vodafone.hu/TechnicalObject/Common/V1">
                <ns0:TraceIdentifier>
                    <ns0:ApplicationId>HybrisWebshop</ns0:ApplicationId>
                    <ns0:CorrelationId>4f8f4ce0-faee-11e5-b0aa-005056aa5f2f</ns0:CorrelationId>
                    <ns0:ReferenceId>7c25c9e9-168c-4e72-987a-4099e9a32932</ns0:ReferenceId>
                    <ns0:ServiceId>http://xmlns.vodafone.hu/BusinessService/VettingInterface/VettingService/callBackCheckAddressDataV2/V1</ns0:ServiceId>
                    <ns0:SenderTimestamp>2016-04-05T07:22:05.8449666+02:00</ns0:SenderTimestamp>
                </ns0:TraceIdentifier>
                <ns0:ClientTimeout>30</ns0:ClientTimeout>
                <ns0:NameValue>
                    <ns0:Name>TargetSystem</ns0:Name>
                    <ns0:Value>HybrisWebshop</ns0:Value>
                </ns0:NameValue>
            </ns0:Header>
            <TransactionId xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">TQA-0000049572</TransactionId>
            <CheckState xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">1</CheckState>
            <CheckMessage xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">Ellenorzés befejezve</CheckMessage>
            <PersonalData xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                <PersonName xmlns="http://xmlns.vodafone.hu/BusinessObject/Contact/V3">
                    <FirstName>FIRSTNAME</FirstName>
                    <MiddleName/>
                    <LastName>LASTNAME</LastName>
                </PersonName>
                <PersonIdentificationData xmlns="http://xmlns.vodafone.hu/BusinessObject/Contact/V3">
                    <BirthName>BIRTHNAME</BirthName>
                    <MotherName>MOTHERNAME</MotherName>
                    <BirthPlace>BIRTHPLACE</BirthPlace>
                    <BirthDate>1956-08-29T00:00:00</BirthDate>
                    <IdentityDocumentInfoList/>
                </PersonIdentificationData>
                <AddressList xmlns="http://xmlns.vodafone.hu/BusinessObject/Contact/V3">
                    <AddressData>
                        <Address>
                            <City xmlns="http://xmlns.vodafone.hu/BusinessObject/Contact/V2">Budapest</City>
                            <ZipCode xmlns="http://xmlns.vodafone.hu/BusinessObject/Contact/V2">1096</ZipCode>
                            <StreetAddress xmlns="http://xmlns.vodafone.hu/BusinessObject/Contact/V2">
                                <StreetName>Haller</StreetName>
                                <StreetType>utca</StreetType>
                                <Number>7</Number>
                                <Building/>
                                <Floor/>
                                <Entrance/>
                                <Door/>
                            </StreetAddress>
                        </Address>
                        <AddressRole>Permanent</AddressRole>
                    </AddressData>
                </AddressList>
            </PersonalData>
        </CallBackCheckAddressDataV2Request>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>